SocialSupport/Documents/ПервичнаяРегистрация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПервичнаяРегистрация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDГражданина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияИНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияГражданина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииГраждан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоциальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоцСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесенВБД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

SocialSupport/Enums/КатегорииГраждан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КатегорииГраждан</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пенсионеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвалиды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногодетныеСемьи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МалоимущиеСемьи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинокиеРодители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СемьиСДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетераныИУчастникиБоевыхДействий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДетиСиротыИДетиОставшиесяБезПопеченияРодителей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БеременныеЖенщиныИЖенщиныСМаленькимиДетьми</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременныеПереселенцыИБеженцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезработныеСтоящиеНаУчетеВСлужбеЗанятости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СемьиВоспитывающиеПриемныхДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

SocialSupport/Enums/СоцСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СоцСтатусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Безработный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенсионер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Студент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Малоимущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеранТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвалид</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпекунИлиПопечитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногодетныйРодитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сирота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Военнослужащий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинокийРодитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

SocialSupport/Enums/СтатусыНуждаемости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыНуждаемости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КритическаяНуждаемость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысокаяНуждаемость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УмереннаяНуждаемость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлабаяНуждаемость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переходный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоддержкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

SocialSupport/Catalogs/Граждане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Граждане</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияИНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снилс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияГражданина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииГраждан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоциальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоцСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатусНуждаемости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНуждаемости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SocialSupport/Documents/ПервичнаяРегистрация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.Дата = ТекущаяДата();
	НачатьТранзакцию();	
	Если НЕ Объект.ВнесенВБД Тогда    
	Объект.ВнесенВБД = Истина;  
	
	Запись = Справочники.Граждане.СоздатьЭлемент();
	
	Запись.КатегорияГражданина = Перечисления.КатегорииГраждан.Неизвестный;
	Запись.СоциальныйСтатус = Перечисления.СоцСтатусы.Неизвестный;
	Запись.ТекущийСтатусНуждаемости = Перечисления.СтатусыНуждаемости.Неизвестный;
	
	Запись.Код = Объект.IDГражданина;  
	Запись.Наименование = Объект.ФИО;
    Запись.ДатаРождения = Объект.ДатаРождения;
	Запись.СерияИНомер = Объект.СерияИНомер;
	Запись.ДатаВыдачи = Объект.ДатаВыдачи;
	Запись.КемВыдан = Объект.КемВыдан;
	Запись.КодПодразделения = Объект.КодПодразделения;
	Запись.ФактическийАдрес = Объект.ФактическийАдрес;
	Запись.НомерТелефона = Объект.НомерТелефона;
	Запись.EMail = Объект.EMail;
	Запись.КатегорияГражданина = Объект.КатегорияГражданина;
	Запись.СоциальныйСтатус = Объект.СоциальныйСтатус;  
	Запись.ДатаРегистрации = Объект.Дата;
	
	Запись.Записать();      
	
	   
	КонецЕсли;
ЗафиксироватьТранзакцию();	
КонецПроцедуры          

&НаКлиенте
Процедура Файлы(Команда)    
	СсылкаГражданина = ПолучитьИнформацию(Объект.ФИО, Объект.СерияИНомер); 
	Если Объект.Ссылка.Пустая() Тогда 
		Предупреждение("Проведите документ перед прикреплением файла.");
	Иначе
		Форма = ПолучитьФорму("Справочник.ФайлыГраждан.Форма.ФормаЭлемента");    
		Форма.Объект.Владелец = СсылкаГражданина;  
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры    

Функция ПолучитьИнформацию(ФИО, СерияИНомер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Граждане.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Граждане КАК Граждане
	|ГДЕ
	|	Граждане.Наименование = &Наименование
	|	И Граждане.СерияИНомер = &СерияИНомер";
	
	Запрос.УстановитьПараметр("Наименование", ФИО); 
	Запрос.УстановитьПараметр("СерияИНомер", СерияИНомер); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецФункции
